app/controllers/api/products_controller.rb

    def show
        @product = Product.includes(:reviews, :seller).find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def index
        @products = Product.includes(:reviews, :seller, photo_attachment: :blob).all
---
SELECT "products".* FROM "products"